In [1]:
import numpy as np
import pandas as pd

In [3]:
sozluk1 = {"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
           "Spor":["Koşu","Yüzme","Koşu","Basletbol"],
           "Kalori":[100,200,300,400]
}

In [4]:
dataFrame1 = pd.DataFrame(sozluk1)

In [5]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basletbol     400

In [6]:
sozluk2 = {"Isim":["Osman","Levent","ATlas","Fatma"],
           "Spor":["Koşu","Yüzme","Koşu","Basletbol"],
           "Kalori":[200,400,350,430]
}

In [7]:
dataFrame2 = pd.DataFrame(sozluk2)

In [8]:
sozluk3 = {"Isim":["Ayşe","Mahmut","Duygu","Nur"],
           "Spor":["Koşu","Yüzme","Badminton","Tenis"],
           "Kalori":[205,600,335,440]
}

In [9]:
dataFrame3 = pd.DataFrame(sozluk3)

In [10]:
dataFrame2

     Isim       Spor  Kalori
0   Osman       Koşu     200
1  Levent      Yüzme     400
2   ATlas       Koşu     350
3   Fatma  Basletbol     430

In [11]:
dataFrame3

     Isim       Spor  Kalori
0    Ayşe       Koşu     205
1  Mahmut      Yüzme     600
2   Duygu  Badminton     335
3     Nur      Tenis     440

## Concatenation (BİRLEŞTİRME)

In [14]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis = 0)

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basletbol     400
0   Osman       Koşu     200
1  Levent      Yüzme     400
2   ATlas       Koşu     350
3   Fatma  Basletbol     430
0    Ayşe       Koşu     205
1  Mahmut      Yüzme     600
2   Duygu  Badminton     335
3     Nur      Tenis     440

## Merge (Kaynaştırma)

In [28]:
mergeSozluk1 = {"Isim": ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Spor": ["Koşu","Yüzme","Koşu","Basketbol"]
               }

In [32]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [33]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [34]:
mergeSozluk2 = {"Isim": ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Kalori": [40,200,30,400]
               }

In [35]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [36]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet      40
1  Mehmet     200
2  Zeynep      30
3    Atıl     400

In [37]:
pd.merge(mergeDataFrame1,mergeDataFrame2, on = "Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu      40
1  Mehmet      Yüzme     200
2  Zeynep       Koşu      30
3    Atıl  Basketbol     400

In [38]:
maasSozluk = {"Isim": ["Ali","Veli","Ayşe","Irem"],
             "Departman":["Yazilim","Satış","Pazarlama","Yazilim"],
              "Maas": [100,200,230,400]
             }

In [39]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [40]:
maasDataFrame

   Isim  Departman  Maas
0   Ali    Yazilim   100
1  Veli      Satış   200
2  Ayşe  Pazarlama   230
3  Irem    Yazilim   400

In [42]:
maasDataFrame["Departman"].unique() # Birdem fazla varsa 1 tanesini getiriyor.

array(['Yazilim', 'Satış', 'Pazarlama'], dtype=object)

In [43]:
maasDataFrame["Departman"].nunique()

3

In [44]:
maasDataFrame["Departman"].value_counts()

Departman
Yazilim      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [48]:
def bruttenNete(maas):
    return maas * 0.66

In [50]:
maasDataFrame["Maas"].apply(bruttenNete) # Uygula Fonksiyonu

0     66.0
1    132.0
2    151.8
3    264.0
Name: Maas, dtype: float64

In [51]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [63]:
yeniBirVeri = {"Karakter Sınıfı": ["South Park","South Park","Simpson","Simpson","Simpson"],
              "Karakter İsmi": ["Cartman","Kenny","Homer","Bart","Bart"],
               "Karakter Yas ": [8,9,10,65,10]
              }

In [64]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [65]:
karakterDF

  Karakter Sınıfı Karakter İsmi  Karakter Yas
0      South Park       Cartman              8
1      South Park         Kenny              9
2         Simpson         Homer             10
3         Simpson          Bart             65
4         Simpson          Bart             10

In [67]:
karakterDF.pivot_table(values = "Karakter Yas" ,index= ["Karakter Sınıfı","Karakter İsmi"],aggfunc= np.sum)

KeyError: 'Karakter Yas'

In [ ]:
karak